tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "microsoft/mssql-release"
tap "ngrok/ngrok"

brew "bash"
brew "cmake"
brew "unixodbc"
brew "freetds"
brew "gcc"
brew "git"
brew "helm"
brew "python@3.10"
brew "httpie"
brew "jpeg"
brew "krb5"
brew "lazygit"
brew "libffi"
brew "node"
brew "openshift-cli"
brew "openssl@3", link: true
brew "pkg-config"
brew "postgresql"
brew "zlib"
brew "zsh"
brew "go"
brew "rust"
brew "mas"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools18"

cask "citrix-workspace"
cask "docker"
cask "eloston-chromium"
cask "figma"
cask "insomnia"
cask "iterm2"
cask "microsoft-teams"
cask "ngrok"
cask "protonmail-bridge"
cask "pycharm"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "typora"
cask "visual-studio-code"
cask "fig"
cask "firefox-developer-edition"
cask "raindropio"
cask "bot-framework-emulator"
cask "obsidian"
cask "iina"
cask "pycharm"
cask "webstorm"
cask "datagrip"
cask "goland"
cask "displaylink"

mas "1Password 7", id: 1333542190
mas "AdGuard for Safari", id: 1440147259
mas "Affinity Designer", id: 824171161
mas "Bear", id: 1091189122
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Save to Raindrop.io", id: 1549370672
mas "The Unarchiver", id: 425424353