# taps
tap "homebrew/bundle"
tap "oven-sh/bun"
tap "hashicorp/tap"
tap "tilt-dev/tap"

# brews
brew "go"
brew "ko"
brew "uv"
brew "fd"
brew "fzf"
brew "bat"
brew "rye"
brew "gcc"
brew "git"
brew "zsh"
brew "lua"
brew "mas"
brew "k9s"
brew "bun"
brew "argo"
brew "llvm"
brew "sops"
brew "stow"
brew "bash"
brew "fish"
brew "make"
brew "curl"
brew "wget"
brew "tmux"
brew "tilt"
brew "kind"
brew "helm"
brew "node"
brew "pnpm"
brew "deno"
brew "gopls"
brew "cmake"
brew "unzip"
brew "pyenv"
brew "argocd"
brew "poetry"
brew "docker"
brew "podman"
brew "colima"
brew "zellij"
brew "sshpass"
brew "showkey"
brew "ripgrep"
brew "lazygit"
brew "chezmoi"
brew "ansible"
brew "luarocks"
brew "starship"
brew "opentofu"
brew "helmfile"
brew "fastfetch"
brew "coreutils"
brew "pre-commit"
brew "python@3.12"
brew "kube-linter"
brew "docker-buildx"
brew "golangci-lint"
brew "kubernetes-cli"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "hashicorp/tap/vault"
brew "tilt-dev/tap/ctlptl"
brew "neovim", args: ['HEAD']

# casks
cask "bruno"
cask "alt-tab"
cask "wireshark"
cask "raindropio"
cask "displaylink"

# fonts
cask "font-sf-pro"
cask "font-meslo-lg"
cask "font-zed-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-zed-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"

# app store apps
mas "Wipr", id: 1320666476
mas "Noir", id: 1592917505
mas "The Unarchiver", id: 425424353
mas "AdGuard for Safari", id: 1440147259
mas "Save to Raindrop.io", id: 1549370672
mas "1Password for Safari", id: 1569813296
