# taps
tap "homebrew/bundle"
tap "oven-sh/bun"
tap "hashicorp/tap"
tap "tilt-dev/tap"

# brews
brew "showkey"
brew "neovim", args: ['HEAD']

# casks
cask "bruno"
cask "alt-tab"
cask "wireshark"
cask "raindropio"
cask "displaylink"

# fonts
cask "font-sf-pro"
cask "font-meslo-lg"
cask "font-zed-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-zed-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"

# app store apps
